{
  "titleNameMap": {
        "educationList": "Education",
        "workExpList": "Work Experience",
        "projectList": "Project Experience",
        "skillList": "Skills",
        "awardList": "Certificate",
        "workList": "Projects",
        "aboutme": "About Me"
    },
  "avatar": {
    "src": "https://",
    "hidden": true
  },
  "profile": {
    "name": "Jingyang Ke",
    "email": "jingyang.ke@outlook.com • jingyang.ke@gatech.edu",
    "mobile": "+1-4044888479 • +86-13705650279",
    "github": "https://github.com/JingyangKe",
    "positionTitle": ""
  },
  "educationList": [
    {
      "edu_time": ["2019.08", "2023.05"],
      "school": "Georgia Institute of Technology",
      "major": "Computer Science"
    }
  ],
  "workExpList": [
    {
      "company_name": "Georgia Institute of Technology",
      "department_name": "Systems Neural Engineering Lab",
      "work_time": ["2021.02", null],
      "work_desc": "Undergraduate Research Assistant. Lead the development of RADICaL 1p, a novel deep learning tool to infer neural population dynamics from noisy one-photon calcium imaging data. Coordinate the lab's collaboration with experimental labs on calcium imaging experiments. Perform Tensorflow 1 to Tensorflow 2 migration on lab's previous projects."
    },
    {
      "company_name": "Emory University",
      "department_name": "School of Medicine",
      "work_time": ["2021.05", "2021.08"],
      "work_desc": "Research Intern. Developed a comparative analysis pipeline for synchronous one-photon calcium imaging data and animal behavior data with CaImAn and DeepLabCut. Upgrade the internet infrastructure of data storage and transform among labs."
    },
    {
      "company_name": "Iflytek Co., Ltd.",
      "department_name": "R&D Group",
      "work_time": ["2020.05", "2020.07"],
      "work_desc": "Software Engineer Intern in cloud computing. Maintained the voice cloud database of Iflytek under the structure of Hadoop and Scala-based Spark. Responded to the demand of mass voice data extraction, developed a data extraction platform for cloud database end users and wrote documentation in company's wiki to solidify the data extraction process."
    }
  ],
  "awardList": [],
  "skillList": [
    {
      "skill_name": "Python",
      "skill_desc": "",
      "skill_level": 85
    },
    {
      "skill_name": "Java",
      "skill_desc": "",
      "skill_level": 80
    },
    {
      "skill_name": "Scala",
      "skill_desc": "",
      "skill_level": 80
    },
    {
      "skill_name": "Machine Learning",
      "skill_desc": "",
      "skill_level": 80
    },
    {
      "skill_name": "SQL",
      "skill_desc": "",
      "skill_level": 75
    },
    {
      "skill_name": "Hadoop and Spark",
      "skill_desc": "",
      "skill_level": 75
    }
  ],
  "projectList": [
    {
      "project_name": "RADICaL 1p",
      "project_role": "Project Leader and Developer",
      "project_time": "2021.08 - present",
      "project_desc": "RADICaL 1p is deep learning tool based on LFADS, a sequential model with RNN-based variational auto-encoder to infer brain neural activities from noisy one-photon calcium imaging data.",
      "project_content": "\n1. Design and implement the deep learning model on Tensorflow 2 \n2. Perform data cleaning on raw data, test the model and analyze result data to check the performance"
    },
    {
      "project_name": "Pharmacological Treatment Analysis for Dystonia and Parkinson's Disease",
      "project_role": "Data Engineer",
      "project_time": "2021.02 - present",
      "project_desc": "Explore animals' neural activities and behaivors to discover and verify the effect of candidate drugs on Dystonia and Parkinson's Disease",
      "project_content": "\n1. Developed a Python-based comparative data analysis pipeline with CaImAn and DeepLabCut on animals' neural and behavior data \n2. Performed data visualization with Matplotlib and Pandas \n3. Apply deep learning models to explore the neural population dynamics and the relationship between neural and behavior data"
    },
    {
      "project_name": "Odeon",
      "project_role": "Developer",
      "project_time": "2020.5 - 2020.7",
      "project_desc": "Odeon is a cloud computing platform developed by Iflytek to maintain, process and visualize mass business data.",
      "project_content": "Developed a self-service data extraction platform for the company's research and business departments based on Apache Zeppelin. This platfrom enabled end users to extract data from Odeon."
    }
  ],
  "workList": [],
  "aboutme": {
    "aboutme_desc": "🌱 Focus on data engineering and research \n Soft Skills：Communication, Teamwork, Problem Solving, Self-management \n A data engineer and researcher with industry cloud computing and big data engineering experience as well as machine learning research experience. Looking for a role where I can grow and learn from senior team members while contributing my knowledge to the team."
  }
}